[
    {
        "id": 1,
        "title": "Stage Week 1",
        "date": "2023-02-06 tot 2023-02-10",
        "content": "Deze week zijn we begonnen met onze stage. De eerste dag was het voorl de bedoeling dat we het bedrijf wat leerde kennen en onze computers in orde maakten. De tweede dag hebben we dan meegedaan met onze eerste dagelijkse stand-Up meeting. Nadien heb ik men computer verder ingesteld. Op dag 3 heb ik dan mijn eerste opdracht gekregen om de breadcrumbs in het project aan te passen. Hiervoor heb ik eerst een docker container moeten opzetten en een beetje uizoeken hoe vue werkt. Hiermee ben ik dan ook de rest van de week bezig geweest naast de dagelijkse standup meetings."
    },
    {
        "id": 2,
        "title": "Stage Week 2",
        "date": "2023-02-13 tot 2023-02-17",
        "content": "De tweede week ben ik vooral bezig geweest met het inwerken op de mannier dat hier gewerkt word. Elke dag heb ik uiteraard meegedaan met de standup meetings. Ik heb me ook extra opzoekingswerk gedaan voor VUE. Dit lijkt wel wat op react, maar het is toch wat wennen om te gebruiken. Dit begint wel steeds beter te gaan ook. Voor de rest heb ik verder gewerkt aan de frontend voor de header van ons project."
    },
    {
        "id": 3,
        "title": "Stage Week 3",
        "date": "2023-02-20 tot 2023-02-24",
        "content": "Deze week is weer begonnen met een DAMS meating. Daarna hebben we wwn nieuwe taak gekregen voor de rest van de week omdat onze begeleiders op vakantie gaan. Deze week ben ik ook begonnen met het leren van docker omdat dit in het project gebruikt wordt en het handig is om daar meer over te weten om mee te kunnen zijn met de werking van het project. Voor het DAMS project heb ik een component en een composable gemaakt van de breadcrumb die in de header zat. Hierdoor moet je nu gewoon de component aanroepen in d header."
    },
    {
        "id": 4,
        "title": "Stage Week 4",
        "date": "2023-02-27 tot 2023-03-03",
        "content": "Tijdends de vierde week van de stage ben ik vooral verder gegaan met het werken aan de header. Hiervoor ben ik aan het uitzoeken geweeest hoe ik een dropdown krijg in een breadcrumb. Ook heb ik al even beken hoe ik deze breadcrumb uiteindelijk ga kunnen testen, want dit is een van de taken die ik heb gekregen. Het testen in vue is volledig nieuw dus hier heb ik vooral wat over opgezocht ne ga ik volgende week in practijk gaan toepassen."
    },
    {
        "id": 5,
        "title": "Stage Week 5",
        "date": "2023-03-06 tot 2023-03-10",
        "content": "Deze week zijn we begonnen met een korte evaluatie van onze stagementoren over hoe het to dit moment is gegaan. Hierna ben ik verder gegaan met het werken aan de header. Het doel was om deze week de breadcrumb functioneel werkende te krijgen. Woensdag hadden we dan intervisie op school over de stage. Daarna ben ik helaas donderdag en vrijdag ziek geweest waardoor ik niet verde heb kunnen werken."
    },
    {
        "id": 6,
        "title": "Stage Week 6",
        "date": "2023-02-13 tot 2023-03-17",
        "content": "Deze week heb ik eerst maandag de functionaliteit van de breadcrumb volledig afgewerkt. Hierna heb ik mezelf ingelezen over hoe testen met vitest in zijn werk gaat. Op dinsdag ben ik begonnen met dit te leren, woensdag hadden we dan een jobbeurs en heb ik dus niet voor stage gewerkt. Donderdag en vrijdag heb ik dan verder gegaan met testen en heb ik dus een test gemaakt om de code van de breadcrumb die ik in de header heb gemaakt te testen. Nadat ik dit gedaan had heb ik een merch request gestuurd zodat mijn code kan worden nagekeken en op de main geimplementeerd kan worden."
    }
]    